[
    {
        "name": "The Thing",
        "alien": true,
        "creators": "John Carpenter, Bill Lancaster",
        "summary": "A shape-shifting extraterrestrial organism that infiltrates an Antarctic research station, mimicking its human hosts and creating paranoia and terror among the survivors.",
        "imgOverview": "https://www.syfy.com/sites/syfy/files/styles/1200x680/public/2018/10/the_thing_1982.jpg"
    },
    {
        "name": "Aaamazzarite",
        "alien": true,
        "creators": "Gene Roddenberry, Harold Livingston",
        "summary": "Peaceful isolationist species from planet Aaamazzara, known for their biochemical ability to create materials. They are members of the Federation but rarely leave their homeworld.",
        "imgOverview": "https://wiki.starbase118.net/wiki/index.php?title=File:Aaamazzarite.jpg"
    },
    {
        "name": "Aalaag",
        "alien": true,
        "creator": "Gordon R. Dickson",
        "summary": "In the novel 'Way of the Pilgrim' by Gordon R. Dickson, Shane, a gifted linguist, has spent his life learning the language of the old and powerful alien race that has conquered Earth. The interstellar masters regard him as a valuable servant, but Shane harbors a secret. He invented 'The Aalaag,' a mysterious figure who incites rebellion and vanishes unseen, leaving a distinctive icon behind. Now, the human underground is preparing to rebel, and Shane knows he will be unable to keep himself from taking part.",
        "imgOverview": "https://www.benespen.com/content/images/content/v1/51259dfce4b01b12552dad3e/1601046458919-WOQPC739B8ULZ8X1IGU5/8db35278d7c7a93593356315667444341587343_v5.jpg"
    },
    {
        "name": "Abductors",
        "alien": true,
        "summary": "The Abductors are fictional aliens from the Nickelodeon animated series Invader Zim, created by Jhonen Vasquez. In the episode 'Abducted,' these aliens claim to be Zim's new neighbors but turn out to be spectacularly stupid. Zim escapes their spaceship disguised as a whale, leaving behind a blob-like being who tearfully asks for help. The Abductors bicker and forget about their escapees, focusing on fusing metal pieces to the Blob Creature and searching for their next specimen, the Earth weasel.",
        "imgOverview": "https://static.wikia.nocookie.net/aliens/images/3/3f/Abductors.jpg/revision/latest?cb=20120223140714"
    }]
    