[
{
        "name": "Baalols",
        "alienValidated": false,
        "sourceType": "book",
        "summary": "The Baalols are a fictional species of alien lifeforms in the Perry Rhodan science fiction series. The Baalols are a highly advanced, technologically sophisticated species that are known for their mastery of space travel and their ability to create artificial intelligence. They are also known for their distinctive appearance, being tall and slender with large, glowing eyes.",
        "imgOverview": "./images/placeholderImg/3-alien.png"
      },{
        "name": "Babel fish",
        "alienValidated": false,
        "sourceType": "book",
        "summary": "The Babel fish is a fictional species from the science fiction comedy series *The Hitchhiker's Guide to the Galaxy* by Douglas Adams. It is a small, yellow, fish-like creature that, when placed in someone's ear, allows them to understand any language. This makes it a popular tool for interstellar communication.",
        "imgOverview": "./images/placeholderImg/4-alien.png"
      },{
        "name": "Badoon",
        "alienValidated": false,
        "sourceType": "comic",
        "summary": "The Badoon are a fictional alien race appearing in American comic books published by Marvel Comics.  The Badoon are technologically advanced spacefaring humanoids with reptilian features, known for their cruel and violent nature. They are primarily antagonists of the Fantastic Four and have been featured in numerous comic book stories.",
        "imgOverview": "./images/placeholderImg/1-alien.png"
      },{
        "name": "Bahmi",
        "alienValidated": false,
        "sourceType": "videogame",
        "summary": "The Bahmi are a fictional alien species in the  *Rift: Planes of Telara* massively multiplayer online role-playing game (MMORPG).  They are a race of aquatic humanoids who live in the Plane of Water.  They are known for their magic and their mastery of the elements.",
        "imgOverview": "./images/placeholderImg/4-alien.png"
      },{
        "name": "Bailies",
        "alienValidated": false,
        "sourceType": "tv",
        "summary": "The Bailies are a fictional alien species from the science fiction television series Cleopatra 2525.  They are humanoid beings with a distinctive green skin and are known for their advanced technology and their love of gambling. They are an important part of the series' recurring cast and are known for their unique culture.",
        "imgOverview": "./images/placeholderImg/1-alien.png"
      },{
        "name": "Bajoran",
        "alienValidated": false,
        "sourceType": "tv",
        "summary": "The Bajorans are a fictional humanoid species from the *Star Trek* universe. They are known for their deeply religious culture and their history of oppression under the rule of the Cardassians. Bajorans are characterized by their distinctive facial markings and their deep spirituality. They are a major part of the *Star Trek: Deep Space Nine* television series, where they play a central role in the show's political and religious themes.",
        "imgOverview": "./images/placeholderImg/1-alien.png"
      }
]